
'use server';

import { db as firestore } from '@/firebase/admin';
import type { Syllabus } from '@/lib/types';

const syllabusData = {
    'Group II': {
        'பகுதி அ': {
            'அலகு I: பொது அறிவியல்': [
                'அறிவியல் அறிவு மற்றும் அறிவியல் உணர்வு - பகுத்தறிதல் - பொருள் உணராமல் கற்றலும் கருத்துணர்ந்து கற்றலும்',
                'கடந்தகாலம், நிகழ்காலம், எதிர்காலம் பற்றி புரிந்து கொள்வதற்கான ஒரு கருவி அறிவியல்',
                'பேரண்டத்தின் இயல்பு - பொது அறிவியல் விதிகள் - இயக்கவியல் - பருப்பொருளின் பண்புகள், விசை, இயக்கம் மற்றும் ஆற்றல்',
                'அன்றாட வாழ்வில் இயக்கவியல், மின்னியல், காந்தவியல், ஒளி, ஒலி, வெப்பம், அணுக்கரு இயற்பியல், லேசர் (LASER), மின்னணுவியல் மற்றும் தகவல் தொடர்பியல் ஆகியவற்றின் அடிப்படை கோட்பாடுகளின் பயன்பாடுகள்',
                'தனிமங்களும் சேர்மங்களும், அமிலங்கள், காரங்கள், உப்புகள், பெட்ரோலிய பொருட்கள், உரங்கள், பூச்சிக்கொல்லிகள்',
                'உயிரியலின் முக்கிய கோட்பாடுகள், உயிர் உலகின் வகைப்பாடு, பரிணாமம், மரபியல், உடலியங்கியல், உணவியல், உடல்நலம் மற்றும் சுகாதாரம், மனிதநோய்கள்',
                'சுற்றுப்புறச்சூழல் மற்றும் சூழலியல்',
                'அறிவியல் மற்றும் தொழில்நுட்பத்தில் அண்மைக்கால கண்டுபிடிப்புகள்',
                'நடப்பு நிகழ்வுகள்',
            ],
            'அலகு II: இந்தியாவின் புவியியல்': [
                'அமைவிடம் - இயற்கை அமைவுகள்',
                'பருவமழை, மழைப்பொழிவு, வானிலை மற்றும் காலநிலை',
                'நீர் வளங்கள் - இந்திய ஆறுகள்',
                'மண், கனிம வளங்கள் மற்றும் இயற்கை வளங்கள்',
                'காடு மற்றும் வன உயிரினங்கள் - வேளாண் முறைகள்',
                'போக்குவரத்து - தகவல் தொடர்பு',
                'சமூகப் புவியியல் - மக்கள்தொகை அடர்த்தி மற்றும் பரவல் - இனம், மொழிக் குழுக்கள் மற்றும் முக்கியப் பழங்குடிகள்',
                'இயற்கைப் பேரிடர் - பேரிடர் மேலாண்மை',
                'சுற்றுச்சூழல் மாசுபடுதல் - காரணங்களும் தடுப்பு முறைகளும் - பருவநிலை மாற்றம் - பசுமை ஆற்றல்',
                'புவியியல் அடையாளங்கள்',
                'நடப்பு நிகழ்வுகள்',
            ],
            'அலகு III: இந்தியாவின் வரலாறு, பண்பாடு மற்றும் இந்திய தேசிய இயக்கம்': [
                'சிந்து சமவெளி நாகரிகம் - குப்தர்கள், தில்லி சுல்தான்கள், முகலாயர்கள் மற்றும் மராத்தியர்கள்',
                'விஜயநகர மற்றும் பாமினி அரசுகளின் காலம் - தென் இந்திய வரலாறு',
                'தேசிய மறுமலர்ச்சி - ஆங்கிலேயர் ஆட்சிக்கு எதிரான தொடக்க கால எழுச்சிகள் - இந்திய தேசிய காங்கரஸ்',
                'தலைவர்கள் உருவாதல் - பி.ஆர்.அம்பேத்கர், பகத்சிங், பாரதியார், வ.உ.சிதம்பரனார், ஜவகர்லால் நேரு, காமராசர், மகாத்மா காந்தி, மௌலானா அபுல் கலாம் ஆசாத், தந்தை பெரியார், இராஜாஜி, சுபாஷ் சந்திர போஸ், ரவீந்திரநாத் தாகூர் மற்றும் பலர்',
                'விடுதலைப் போராட்டத்தின் பல்வேறு நிலைகள்: அகிம்சை முறையின் வளர்ச்சி மற்றும் புரட்சிகர இயக்கங்கள்',
                'வகுப்புவாதம் மற்றும் தேசப்பிரிவினை',
                'இந்திய சமூகப் பண்பாட்டு வரலாற்றில் மாற்றங்களும் தொடர்ச்சியும்',
                'இந்தியப் பண்பாட்டின் இயல்புகள், வேற்றுமையில் ஒற்றுமை - இனம், மொழி, வழக்காறு',
                'இந்தியா ஒரு மதச்சார்பற்ற நாடு, சமூக நல்லிணக்கம்',
                'கலை, அறிவியல், இலக்கியம் மற்றும் தத்துவம் ஆகிய வெவ்வேறு துறைகளில் தனித்துவம் கொண்ட ஆளுமைகள்',
            ],
             'அலகு IV: இந்திய ஆட்சியியல்': [
                'இந்திய அரசியலமைப்பு - அரசியலமைப்பின் முகவுரை - அரசியலமைப்பின் முக்கிய கூறுகள் - ஒன்றியம், மாநிலம் மற்றும் யூனியன் பிரதேசங்கள்',
                'குடியுரிமை, அடிப்படை உரிமைகள், அடிப்படைக் கடமைகள், அரசின் நெறிமுறைக் கோட்பாடுகள்',
                'ஒன்றிய நிர்வாகம், ஒன்றிய நாடாளுமன்றம் - மாநில நிர்வாகம், மாநில சட்டமன்றம் - உள்ளாட்சி அமைப்புகள், பஞ்சாயத்து ராஜ்',
                'கூட்டாட்சியின் அடிப்படைத் தன்மைகள்: மத்திய - மாநில உறவுகள்',
                'தேர்தல் - இந்திய நீதி அமைப்புகள் - சட்டத்தின் ஆட்சி',
                'பொதுவாழ்வில் ஊழல் - ஊழல் தடுப்பு நடவடிக்கைகள்- லோக்பால் மற்றும் லோக் ஆயுக்தா',
                'தகவல் உரிமை - பெண்களுக்கு அதிகாரமளித்தல் - நுகர்வோர் பாதுகாப்பு அமைப்புகள் - மனித உரிமைகள் சாசனம்',
                'இந்தியாவில் அரசியல் கட்சிகளும் மற்றும் ஆட்சியல் முறைகளும்',
                'நடப்பு நிகழ்வுகள்',
            ],
            'அலகு V: இந்தியப் பொருளாதாரம் மற்றும் தமிழ்நாட்டில் வளர்ச்சி நிர்வாகம்': [
                'இந்தியப் பொருளாதாரத்தின் இயல்புகள் - ஐந்தாண்டு திட்ட மாதிரிகள் - ஒரு மதிப்பீடு - திட்டக்குழு மற்றும் நிதி ஆயோக்',
                'வருவாய் ஆதாரங்கள் - இந்திய ரிசர்வ் வங்கி - நிதி கொள்கை மற்றும் பணவியல் கொள்கை - நிதி ஆணையம் - மத்திய மாநில அரசுகளுக்கிடையேயான நிதிப் பகிர்வு - சரக்கு மற்றும் சேவை வரி',
                'இந்திய பொருளாதார அமைப்பு மற்றும் வேலைவாய்ப்பு உருவாக்கம், நிலச் சீர்திருத்தங்கள் மற்றும் வேளாண்மை - வேளாண்மையில் அறிவியல் தொழில்நுட்பத்தின் பயன்பாடு - தொழில் வளர்ச்சி - ஊரக நலன்சார் திட்டங்கள் - சமூகப் பிரச்சனைகள் - மக்கள்தொகை, கல்வி, நலவாழ்வு, வேலைவாய்ப்பு, வறுமை',
                'தமிழ்நாட்டின் மனிதவள மேம்பாட்டுக் குறியீடுகளும் அவற்றை தேசிய மற்றும் பிற மாநிலங்களுக்கான குறியீடுகளுடன் ஒப்பாய்வும்',
                'தமிழ்நாட்டின் சமூக பொருளாதார வளர்ச்சிக்கு சமூக மறுமலர்ச்சி இயக்கங்களின் பங்களிப்பு: அரசியல் கட்சிகளும் பலதரப்பு மக்களுக்கான நலத்திட்டங்களும் - இட ஒதுக்கீட்டுக் கொள்கைக்கான நியாயங்களும் சமூக வளங்களைப் பெறும் வாய்ப்புகளும்',
                'தமிழ்நாட்டின் பொருளாதார போக்குகள் - தமிழ்நாட்டின் சமூக பொருளாதார வளர்ச்சியில் சமூகநலத் திட்டங்களின் தாக்கமும் பங்களிப்பும்',
                'சமூக நீதியும் சமூக நல்லிணக்கமும் சமூகப் பொருளாதார மேம்பாட்டின் மூலாதாரங்கள்',
                'தமிழ்நாட்டின் கல்வி மற்றும் நலவாழ்வு (Health) முறைமைகள்',
                'தமிழ்நாட்டின் புவியியல் கூறுகளும் பொருளாதார வளர்ச்சியில் அவற்றின் தாக்கமும்',
                'பல்வேறு துறைகளில் தமிழ்நாடு நிகழ்த்தியுள்ள சாதனைகள்',
                'தமிழ்நாட்டில் மின்னாளுகை',
                'பொது விழிப்புணர்வும் (Public Awareness) பொது நிர்வாகமும் - நலன்சார் அரசுத் திட்டங்களும் அவற்றின் பயன்பாடும், பொது விநியோக அமைப்புகளில் (Public delivery systems) நிலவும் சிக்கல்கள்',
                'தற்போதைய சமூகப் பொருளாதார பிரச்சனைகள்',
                'நடப்பு நிகழ்வுகள்',
            ],
            'அலகு VI: தமிழ்நாட்டின் வரலாறு, பண்பாடு, மரபு மற்றும் சமூக - அரசியல் இயக்கங்கள்': [
                'தமிழ் சமுதாய வரலாறு, அது தொடர்பான தொல்லியல் கண்டுபிடிப்புகள், சங்க காலம் முதல் இக்காலம் வரையிலான தமிழ் இலக்கிய வரலாறு',
                'திருக்குறள் - மதச் சார்பற்ற தனித்தன்மையுள்ள இலக்கியம் - அன்றாட வாழ்வியலோடு தொடர்புத் தன்மை - மானுடத்தின் மீதான திருக்குறளின் தாக்கம் - திருக்குறளும் மாறாத விழுமியங்களும் - சமூக அரசியல் பொருளாதார நிகழ்வுகளில் திருக்குறளின் பொருத்தப்பாடு - திருக்குறளில் தத்துவக் கோட்பாடுகள்',
                'விடுதலைப் போராட்டத்தில் தமிழ்நாட்டின் பங்கு - ஆங்கிலேயருக்கு எதிரான தொடக்க கால கிளர்ச்சிகள் - விடுதலைப் போராட்டத்தில் பெண்களின் பங்கு',
                'பத்தொன்பது மற்றும் இருபதாம் நூற்றாண்டுகளில் தமிழ்நாட்டின் சமூக - அரசியல் இயக்கங்களின் பரிணாம வளர்ச்சி',
                'நீதிக்கட்சி, பகுத்தறிவு வாதத்தின் வளர்ச்சி',
                'சுயமரியாதை இயக்கம், திராவிட இயக்கம் மற்றும் இவ்வியக்கங்களுக்கான அடிப்படை கொள்கைகள்',
                'தந்தை பெரியார் மற்றும் பேரறிஞர் அண்ணாவின் பங்களிப்புகள்',
            ]
        },
        'பகுதி ஆ': {
            'அலகு I: திறனறிவு': [
                'சுருக்குதல்',
                'விழுக்காடு',
                'மீப்பெரு பொதுக் காரணி (HCF)',
                'மீச்சிறு பொது மடங்கு (LCM)',
                'விகிதம் மற்றும் விகிதாச்சாரம்',
                'தனிவட்டி - கூட்டு வட்டி',
                'பரப்பு - கொள்ளளவு',
                'காலம் மற்றும் வேலை',
            ],
            'அலகு II: காரணவியல்': [
                'தருக்கக் காரணவியல்',
                'புதிர்கள்',
                'பகடை',
                'காட்சிக் காரணவியல்',
                'எண் எழுத்துக் காரணவியல்',
                'எண் வரிசை',
            ],
        },
    }
};

async function addGroup2SyllabusTopics() {
    console.log('Adding Group II syllabus topics...');
    const syllabusCollection = firestore.collection('syllabus');

    // Delete existing Group II topics to prevent duplicates
    console.log('First, deleting all existing Group II syllabus topics to prevent duplicates...');
    const deleteBatch = firestore.batch();
    const q = syllabusCollection.where('examGroup', '==', 'Group II');
    try {
        const querySnapshot = await q.get();
        querySnapshot.forEach((doc) => {
            deleteBatch.delete(doc.ref);
        });
        await deleteBatch.commit();
        console.log(`Deleted ${querySnapshot.size} existing Group II topics.`);
    } catch (error) {
        console.error('Error deleting existing syllabus topics:', error);
        return; // Stop if deletion fails
    }

    const addBatch = firestore.batch();

    for (const [examGroup, parts] of Object.entries(syllabusData)) {
        for (const [part, units] of Object.entries(parts)) {
            for (const [unitFullName, topics] of Object.entries(units)) {
                const [unit, unitName] = unitFullName.split(': ');
                for (const topic of topics) {
                    const newDocRef = syllabusCollection.doc();
                    const syllabusEntry: Omit<Syllabus, 'id'> = {
                        examGroup: examGroup as any,
                        part,
                        unit,
                        unitName: unitName.trim(),
                        topic,
                    };
                    addBatch.set(newDocRef, {id: newDocRef.id, ...syllabusEntry});
                }
            }
        }
    }

    try {
        await addBatch.commit();
        console.log(`Successfully added Group II syllabus topics.`);
    } catch (error) {
        console.error('Error adding syllabus topics:', error);
    }
}

addGroup2SyllabusTopics();
